# LayoutRuleFixedNumber Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayoutRuleFixedNumber Constructor
LayoutRuleFixedNumber Class See Also
---
Constructor of LayoutRuleFixedNumber.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LayoutRuleFixedNumber(
	int numberOfLines
)
```

Visual Basic
---
```text
Public Sub New ( _
	numberOfLines As Integer _
)
```

Visual C++
---
```text
public:
LayoutRuleFixedNumber(
	int numberOfLines
)
```

# ### Parameters
numberOfLines
    Type: System..::..Int32 The value of numberOfLines must be positive.
# Remarks
Create a LayoutRuleFixedNumber object with the number of the beams and this number must be positive.
# See Also
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace